:: =========================================================================================================

:: นี่ไม่ใช่ส่วนโค้ด ห้ามคัดลอกส่วนนี้แล้วนำไปวางในโค้ด ::
:: This part is not the main code DONT COPY ::

:: Pull.bat
:: สคริปต์จะทำการรันคำสั่ง git pull origin main เพื่อรวมโค้ดล่าสุดเข้ากับเครื่องของคุณ

:: =========================================================================================================

@echo off
echo ===================================
echo   Auto Git Pull
echo ===================================
echo.

echo Pulling latest code from remote...
git pull origin main

echo.
echo Pull completed!
pause
